a = [1, 2, 3]

# # 특정 위치의 요소를 리스트 형태로 교체
a[1]= ['a','b', 'c'] # [1, [a, b, c], 3]
print(a)

print(a[0])
print(a[1])
print(a[1][0])

# 슬라이싱 : 지정한 범위의 요소를 제거하고 새로운 요소를 넣음
b = [1, 2, 3, 4, 5]
b[1:3] = [1000]
print(b)

b[1:2] = ['a', 'b', 'c']
# b[1:2] = [['a', 'b', 'c']] []포함해서 삽입(리스트 형태)
print(b)

# 리스트로 오늘의 명언 10개 넣고 랜덤으로 하나 출력하기


import random

a = ['삶이 있는 한 희망은 있다', '실패하면 실망할지도 모른다. 그러나 시도조차 하지 않으면 불행해진다', 
'바깥으로 달아나지 말고 너 자신 속을 파고들어라. 진리란 사람의 마음속에 있다.',
'나 자신에 대한 자신감을 잃으면 온 세상이 나의 적이 된다', '모든 언행을 칭찬하는 자보다 결점을 친절하게 말해주는 친구를 가까이하라.',
'행복의 한쪽 문이 닫히면 다른 쪽 문이 열린다.', '사막이 아름다운 것은 어딘가에 샘이 숨겨져 있기 때문이다', 
'당신이 할 수 있다고 믿든 할 수 없다고 믿든, 믿는 대로 될 것이다', 
'인간 최대의 승리는 내가 나를 이기는 것이다.', '평화로운 마음을 가져라. 그로써 다른 이들에게도 평화를 줄 수 있다']
print(random.choice(a))